/*
 * vehicle.h
 *
 *  Created on: 2018/6/26
 *      Author: user
 */

#ifndef VEHICLE_VEHICLE_H_
#define VEHICLE_VEHICLE_H_

//================================================================
//STATUS MASK
#define VEH_INIT_DATA_STATUS					0x80000000
#define	VEH_INVALID_DATA_STATUS					0x40000000
#define VEH_VALID_DATA_STATUS					0x00000000

//DATA MASK
#define VEH_VALID_DATA_OFF						0x00000000
//EPS SPEED
//DASHBOARD SPEED
//YAWRATE
//STEERING ANGLE
//GEAR
#define VEH_GEAR_P_ON_MASK						0x00000001
#define VEH_GEAR_R_ON_MASK						0x00000002
#define VEH_GEAR_N_ON_MASK						0x00000004
#define VEH_GEAR_D_ON_MASK						0x00000008
#define VEH_GEAR_S_ON_MASK						0x00000010
#define VEH_GEAR_P_INVALID_MASK					0x00010000
#define VEH_GEAR_R_INVALID_MASK					0x00020000
#define VEH_GEAR_N_INVALID_MASK					0x00040000
#define VEH_GEAR_D_INVALID_MASK					0x00080000
#define VEH_GEAR_S_INVALID_MASK					0x00100000
//IGN
#define VEH_IGN_ACC_MASK						0x00000001
#define VEH_IGN_ON_MASK							0x00000002
#define VEH_IGN_CRACK_MASK						0x00000004
#define VEH_IGN_ACC_INVALID_MASK				0x00010000
#define VEH_IGN_ON_INVALID_MASK					0x00020000
#define VEH_IGN_CRACK_INVALID_MASK				0x00040000
//TURN INDICATOR
#define VEH_TURN_INDICATOR_RIGHT_ON_MASK		0x00000001
#define VEH_TURN_INDICATOR_LEFT_ON_MASK			0x00000002
#define VEH_TURN_INDICATOR_RIGHT_INVALID_MASK	0x00010000
#define VEH_TURN_INDICATOR_LEFT_INVALID_MASK	0x00020000
//DOOR
#define VEH_DOOR_FRONT_RIGHT_ON_MASK			0x00000001

#define VEH_EPS_SPEED_FACTOR						100
#define VEH_DASHBOARD_SPEED_FACTOR					100
#define VEH_GY_ROLL_PITCH_YAW_FACTOR				100
#define VEH_ACC_XYZ_FACTOR							1
#define VEH_IMU_TEMPERATURE_FACTOR					10
#define VEH_RADIUS_FACTOR							1
#define VEH_STEERING_ANGLE_FACTOR					10
#define VEH_3D_SPEED_FACTOR							100
#define VEH_ATTITUDE_ANGLE_FACTOR					100

typedef enum{
	VEH_STATUS_VALID = 0,
	VEH_STATUS_INVALID = 1,
	VEH_STATUS_NOT_GET_DATA = 2,
	VEH_STATUS_UNKNOWN
}VEHICLE_STATUS_E;

typedef enum{
	VEH_GEAR_P = 0,
	VEH_GEAR_R = 1,
	VEH_GEAR_N = 2,
	VEH_GEAR_D = 3,
	VEH_GEAR_S = 4,
	VEH_GEAR_UNKNOWN
}VEH_GEAR_E;

typedef enum{
	VEH_IGN_OFF = 0,
	VEH_IGN_ACC = 1,
	VEH_IGN_ON = 2,
	VEH_IGN_CRACK = 3,
	VEH_IGN_UNKNOWN
}VEH_IGN_E;

typedef enum{
	VEH_TRUN_INDICATOR_ALL_OFF = 0,
	VEH_TRUN_INDICATOR_RIGHT_ON = 1,
	VEH_TRUN_INDICATOR_LEFT_ON = 2,
	VEH_TRUN_INDICATOR_UNKNOWN
}VEH_TURN_INDICATOR_E;

typedef enum{
	VEH_DOOR_FRONT_RIGHT = 0,
	VEH_DOOR_REAR_RIGHT = 1,
	VEH_DOOR_FRONT_LEFT = 2,
	VEH_DOOR_REAR_LEFT = 3,
	VEH_DOOR_TRUNK = 4,
	VEH_DOOR_SUNROOF = 5,
	VEH_DOOR_UNKNOWN
}VEH_DOOR_E;

typedef enum{
	VEH_DOOR_STATUS_CLOSE = 0,
	VEH_DOOR_STATUS_OPEN = 1
}VEH_DOOR_STATUS_E;

typedef enum{
	VEH_PARKING_BRAKE_LEVER_OFF = 0,
	VEH_PARKING_BRAKE_LEVER_ON = 1,
	VEH_PARKING_BRAKE_LEVER_UNKNOWN
}VEH_PARKING_BRAKE_LEVER_E;

typedef enum{
	VEH_HEADLAMP_OFF = 0,
	VEH_HEADLAMP_LOW = 1,
	VEH_HEADLAMP_HIGH = 2,
	VEH_HEADLAMP_UNKNOWN
}VEH_HEADLAMP_E;

typedef enum{
	VEH_WIPER_OFF = 0,
	VEH_WIPER_INT = 1,
	VEH_WIPER_LOW = 2,
	VEH_WIPER_HIGH = 3,
	VEH_WIPER_UNKNOWN
}VEH_WIPER_E;

typedef enum{
	VEH_PEPS_LOCK = 0,
	VEH_PEPS_UNLOCK = 1,
	VEH_PEPS_UNKNOWN
}VEH_PEPS_E;

typedef enum{
	VEH_DOOR_LOCK_LEFT = 0,
	VEH_DOOR_LOCK_RIGHT = 1,
	VEH_DOOR_LOCK_UNKNOWN
}VEH_DOOR_LOCK_E;

typedef enum{
	VEH_DOOR_LOCK_STATUS_LOCK = 0,
	VEH_DOOR_LOCK_STATUS_UNLOCK = 1
}VEH_DOOR_LOCK_STATUS_E;

typedef enum{
	VEH_MOTION_STATUS_STATIONARY = 0,
	VEH_MOTION_STATUS_MOVING = 1,
	VEH_MOTION_STATUS_UNKNOWN
}VEHICLE_MOTION_E;

typedef enum {
	VEH_EPS_SPEED = 0,
	VEH_DASHBOARD_SPEED = 1,
	VEH_VEHICLE_YAW_RATE = 2,
	VEH_STEERING_ANGLE = 3,
	VEH_GEAR = 4,
	VEH_IGN = 5,
	VEH_TRUN_INDICATOR = 6,
	VEH_DOOR = 7,
	VEH_PARKING_BRAKE_LEVER = 8,
	VEH_HEADLAMP = 9,
	VEH_WIPER = 10,
	VEH_NORTH_SPEED = 11,
	VEH_EAST_SPEED = 12,
	VEH_UP_SPEED = 13,
	VEH_YAW_ANGLE = 14,
	VEH_PITCH_ANGLE = 15,
	VEH_ROLL_ANGLE = 16,
	VEH_PEPS	= 17,
	VEH_DOOR_LOCK	= 18,
	VEH_ONBOARD_RAW_ROLL_RATE = 19,
	VEH_ONBOARD_RAW_PITCH_RATE = 20,
	VEH_ONBOARD_RAW_YAW_RATE = 21,
	VEH_ONBOARD_FILTERED_ROLL_RATE = 22,
	VEH_ONBOARD_FILTERED_PITCH_RATE = 23,
	VEH_ONBOARD_FILTERED_YAW_RATE = 24,
	VEH_ONBOARD_RAW_ACC_X = 25,
	VEH_ONBOARD_RAW_ACC_Y = 26,
	VEH_ONBOARD_RAW_ACC_Z = 27,
	VEH_ONBOARD_FILTERED_ACC_X = 28,
	VEH_ONBOARD_FILTERED_ACC_Y = 29,
	VEH_ONBOARD_FILTERED_ACC_Z = 30,
	VEH_ONBOARD_TEMPERATURE = 31,
	VEH_RADIUS = 32,
	VEH_FILTERED_YAW_RATE = 33,
	VEH_ONBOARD_RADIUS = 34,
	VEH_TWO_SRC_FILTERED_YAW_RATE = 35,
	VEH_MOTION = 36,
	INVALID
}VEHICLE_INFO_E;

typedef union vehicle_item{
	int32_t R[INVALID];
	struct {
		int32_t  eps_speed;				//0
		int32_t  dashboard_speed;		//1
		int32_t  yaw_rate;				//2
		int32_t  steering_angle;		//3
		int32_t  gear;					//4
		int32_t  ign;					//5
		int32_t  turn_indicator;		//6
		int32_t  door;					//7
		int32_t	 parking_brake_lever;	//8
		int32_t	 headlamp;				//9
		int32_t	 wiper;					//10
		int32_t  north_speed;			//11
		int32_t	 east_speed;			//12
		int32_t  up_speed;				//13
		int32_t  yaw_angle;				//14
		int32_t  pitch_angle;			//15
		int32_t  roll_angle;			//16
		int32_t	 peps;					//17
		int32_t  door_lock;				//18
		int32_t  onboard_raw_roll_rate;	//19
		int32_t  onboard_raw_pitch_rate;//20
		int32_t  onboard_raw_yaw_rate;	//21
		int32_t  onboard_filtered_roll_rate;	//22
		int32_t  onboard_filtered_pitch_rate;	//23
		int32_t  onboard_filtered_yaw_rate;		//24
		int32_t  onboard_raw_acc_x;		//25
		int32_t  onboard_raw_acc_y;		//26
		int32_t  onboard_raw_acc_z;		//27
		int32_t  onboard_filtered_acc_x;//28
		int32_t  onboard_filtered_acc_y;//29
		int32_t  onboard_filtered_acc_z;//30
		int32_t  onboard_temperature;	//31
		int32_t  radius;				//32
		int32_t  filtered_yaw;			//33
		int32_t  onboard_radius;		//34
		int32_t  two_src_filtered_yaw;	//35
		int32_t  motion;				//36
		}B;
}vehicle_data_info_t, *vehicle_data_info_p;
#endif /* VEHICLE_VEHICLE_H_ */
//========================================================
//Function
void vehicle_init();
//get function
//eps speed
float get_eps_speed_value(void);
VEHICLE_STATUS_E get_eps_speed_status(void);
//dashboard speed
float get_dashboard_speed_value(void);
VEHICLE_STATUS_E get_dashboard_speed_status(void);
//3D speed
float get_north_speed_value(void);
VEHICLE_STATUS_E get_north_speed_status(void);
float get_east_speed_value(void);
VEHICLE_STATUS_E get_east_speed_status(void);
float get_up_speed_value(void);
VEHICLE_STATUS_E get_up_speed_status(void);
//Attitude Angle
float get_yaw_angle_value(void);
VEHICLE_STATUS_E get_yaw_angle_status(void);
float get_pitch_angle_value(void);
VEHICLE_STATUS_E get_pitch_angle_status(void);
float get_roll_angle_value(void);
VEHICLE_STATUS_E get_roll_angle_status(void);
//yawrate
float get_yaw_rate_value(void);
